Tekla Open API Reference for Tekla Structures 2025
Operation.ProgressBar.Canceled Method
 Check if cancel has been pressed.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Canceled()
Public Function Canceled As Boolean
Return Value
Type: Boolean
True if cancel has been pressed.
See Also
Reference
Operation.ProgressBar Class
Tekla.Structures.Model.Operations Namespace